const $ = {};

// TODO
// 1. TITLE: String (Изменение заголовка)
// 2. closable: boolean (работа крестика закрытия)
// 3. content: string ()
// 4. width: string (400px) - регулируемая ширина окна
// 5. destroy() - уничтожение инстанса окна (44:00 видео)
// 6. При нажатии на оверлей окно тоже должно закрываться
// 7. setContent(html: string) - динамическое изменение содержимого окна
//============================================================
// 8. onClose(void), onOpen(void), beforeClose(boolean)
// 9. animate.css (сторонняя библиотека)
//=========================lesson_2==================================
//1. Динамически на основе массива вывести список карточек
//2. Показать цену в модалке (должна быть одна модалка)
//3. Модалка для удаления с 2мя кнопками
//-----------
//4. На основе $.modal нужно сделать другой плагин $.confirm (на Promise)
//TODO
